app/controllers/posts_controller.rb

SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
---
  def index
    @authors = Author.all
    @posts = if params[:author].present?
               Post.by_author(params[:author])
             elsif params[:date].present?
               if params[:date] == 'Today'
                 Post.from_today
               else
                 Post.old_news
               end
             else
               # if no filters are applied, show all posts
               Post.all